Revit 2027 API
Pipe.PipeType Property
 The pipe type of this pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeType PipeType { get; set; }
Public Property PipeType As PipeType
	Get
	Set
public:
property PipeType^ PipeType {
	PipeType^ get ();
	void set (PipeType^ value);
}
member PipeType : PipeType with get, set
Property Value
PipeType
See Also
Reference
Pipe Class
Autodesk.Revit.DB.Plumbing Namespace